{"id":2988,"date":"2018-09-23T13:53:08","date_gmt":"2018-09-23T12:53:08","guid":{"rendered":"https:\/\/www.robinmcdonald.co.uk\/?p=2988"},"modified":"2018-09-23T13:53:08","modified_gmt":"2018-09-23T12:53:08","slug":"learner-drivers-and-the-dreaded-roundabouts-read-how-to-look-assess-decide-and-act","status":"publish","type":"post","link":"https:\/\/www.robinmcdonald.co.uk\/2018\/09\/23\/learner-drivers-and-the-dreaded-roundabouts-read-how-to-look-assess-decide-and-act\/","title":{"rendered":"Learner drivers and the dreaded roundabouts&#8230;..read how to Look, Assess, Decide and Act!"},"content":{"rendered":"<div class=\"section section__article-content\">\n<div class=\"inner\">\n<div class=\"section section__wygwam\">\n<div class=\"wygwam\">\n<h2>Why do we have roundabouts?<\/h2>\n<p>When two, or more, busy roads intersect – something has to give.<\/p>\n<p>Roundabouts are designed to keep traffic moving, ease congestion and speed up journey times.<\/p>\n<p>They’re also safer than traditional junctions and crossroads – where drivers can be tempted to run red lights. On roundabouts traffic always travels in the same direction, making manoeuvres like right turns far easier.<\/p>\n<p>&nbsp;<\/p>\n<h2>How do roundabouts work?<\/h2>\n<p><img decoding=\"async\" src=\"https:\/\/www.rac.co.uk\/drive\/images\/uploads\/panel-images\/Roundabouts_-_how_to_use.jpg\" alt=\"Roundabouts\" \/><\/p>\n<p>The approaching traffic usually gives way to traffic already on the roundabout, which always comes from the right.<\/p>\n<p>By waiting for a safe gap – you can join the flow of traffic and continue in the correct lane until reaching your exit.<\/p>\n<p>Ensure that you signal before you leave the roundabout. You would usually signal as you pass the exit just before the one you need.<\/p>\n<p>It’s also possible and recommended to use a roundabout to perform a U-turn. This is the safest option.<\/p>\n<p>Like regular roads, larger roundabouts consist of different lanes. Only by joining a roundabout in the correct lane will you be able to access your chosen exit.<\/p>\n<p>A typical roundabout has three or four exits, although in some cases there can be as many as seven, or as few as two.<\/p>\n<p>&nbsp;<\/p>\n<h3>Approaching a roundabout and picking the correct lane<\/h3>\n<p>You’ll know you’re approaching a roundabout when you see a red triangle warning sign with a black circular emblem inside. However not all roundabouts are signposted.<\/p>\n<p>Mini-roundabouts, will usually be flanked with a blue circle sign with three white circular arrows inside.<\/p>\n<\/div>\n<\/div>\n<div class=\"section section__gallery\">\n<div class=\"gallery-container\">\n<div class=\"carousel-container\">\n<ul class=\"image-gallery\">\n<li><img decoding=\"async\" src=\"https:\/\/d1ix0byejyn2u7.cloudfront.net\/drive\/images\/uploads\/panel-images\/ws_cropper\/4_5x0_784x523_794x530_roundabouts_sign.jpg\" alt=\"Roundabout sign\" \/><\/li>\n<li><img decoding=\"async\" src=\"https:\/\/d1ix0byejyn2u7.cloudfront.net\/drive\/images\/uploads\/panel-images\/ws_cropper\/4_5x0_784x523_794x530_mini_roundabouts.jpg\" alt=\"Mini roundabout sign\" \/><\/li>\n<\/ul>\n<ul class=\"pagination\">\n<li><\/li>\n<li><\/li>\n<li class=\"page item-2 last\">Mini roundabouts work in the same way as larger ones, but often appear in narrower residential areas.<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<\/div>\n<div class=\"section section__wygwam\">\n<div class=\"wygwam\">\n<p>Once you’ve identified a roundabout ahead, it’s time to start making your preparations and crucially select the correct lane.<\/p>\n<p>Road markings in the form of arrows (and often text), work together with road signs on the roundabout approach to indicate which lanes go where on each specific roundabout.<\/p>\n<p>But you’ll soon get into the habit of selecting the lane you’ll need, and in some cases you’ll even have a choice.<\/p>\n<p>Once you’ve reached the roundabout and decided whether you need to stop or whether you can continue if the road is clear then select the correct gear.<\/p>\n<p>Now it’s time to acknowledge the golden rule of roundabouts:<\/p>\n<p><strong>Give way to traffic coming from the right.<\/strong><\/p>\n<p>Ensure you’re signalling in the direction you want to take before entering the roundabout, unless you’re travelling straight on, in which case you don’t need to signal until you pass the exit before the one you are going to use.<\/p>\n<p>If the roundabout has standing traffic, you can only join it if you will not block any entrances or exits.<\/p>\n<p>&nbsp;<\/p>\n<h3>Turning left<\/h3>\n<p>If you’re taking a left turn at a roundabout (usually the 1st exit), you’ll always need to approach it in the left lane.<\/p>\n<p>Ensure you remain in the left-hand lane for the entire time you’re on the roundabout. Keep your left indicator on and leave via the first exit.<\/p>\n<h3>Continuing straight ahead<\/h3>\n<p>Often, you, just want to travel straight on through the roundabout, sometimes people will say: &#8216;head straight over the roundabout&#8217;.<\/p>\n<p>Depending on the size of the roundabout, you’ll often be able to use the left-hand lane for this, but in some cases the left-hand lane will be for left turns only (signs will guide you on this).<\/p>\n<p>There are also instances where larger roundabouts, have a designated lane for driving straight over. Check the road markings on approach.<\/p>\n<p>Just after the first exit, check your main mirror, then your left door mirror. Signal left and if all is clear, take your exit.<\/p>\n<h3>Turning right<\/h3>\n<p>If you’re taking a right turn at a roundabout, (typically the 3rd exit), you’ll need to travel around it from the right-hand lane.<\/p>\n<p>Continue in the right-hand lane until you pass the 2nd exit. Check your main mirror, then your left door mirror and signal left.<\/p>\n<p>You’ll need to move into the left lane before exiting – so check your blind spot while doing this with a quick glance over your left shoulder. Once in the left lane you’re ready to exit.<\/p>\n<p>&nbsp;<\/p>\n<\/div>\n<\/div>\n<div class=\"section section__accordion\">\n<div class=\"accordion-panel-wrapper\">\n<div class=\"intro\">\n<h3><\/h3>\n<\/div>\n<div class=\"accordion-container\">\n<ul class=\"accordion\">\n<li class=\"accordion-item\">\n<div class=\"accordion-title\">\n<h4>Mirror<\/h4>\n<\/div>\n<\/li>\n<li class=\"accordion-item\">\n<div class=\"accordion-title\">\n<h4>Signal<\/h4>\n<\/div>\n<\/li>\n<li class=\"accordion-item\">\n<div class=\"accordion-title\">\n<h4>Position<\/h4>\n<\/div>\n<\/li>\n<li class=\"accordion-item\">\n<div class=\"accordion-title\">\n<h4>Speed<\/h4>\n<\/div>\n<\/li>\n<li class=\"accordion-item\">\n<div class=\"accordion-title\">\n<h4>Look<\/h4>\n<\/div>\n<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<\/div>\n<div class=\"section section__wygwam\">\n<div class=\"wygwam\">\n<h2>How could I fail my test at a roundabout?<\/h2>\n<p>Here we take a look at potential mistakes you could make on your driving test and whether they will constitute a fail or not.<\/p>\n<p>You can have up to 15 driver faults but just one serious fault means a fail.<\/p>\n<h3>Hesitating at a roundabout<\/h3>\n<p>Of course you won’t be penalised for ‘not taking a chance’, and nobody wants you to take risks, but if you miss a clear-cut, safe opportunity to join a roundabout, you’ll be holding up traffic for no good reason.<\/p>\n<p>A short delay may be marked as a driver fault. If you miss a clear opportunity where there was plenty of time to proceed you may fail the test as a serious fault could be marked.<\/p>\n<p>If it’s clear early on that you’re fine to continue, do so without stopping completely – which could cause a rear-end collision<\/p>\n<h3>Failure to safely address a wrong lane choice<\/h3>\n<p>You won’t fail your test for choosing the wrong lane – it’s all about how you react. Use mirrors, checks, speed and signals to get back on track and you’ll be fine.<\/p>\n<h3>Driving straight over the centre of a mini-roundabout<\/h3>\n<p>While clipping the painted, or raised centre is unlikely to result in a failure, blatantly driving over it will.<\/p>\n<h3>Failure to signal<\/h3>\n<p>Particularly if cutting across lanes to exit on a right turn, you’ll be heavily penalised for not signalling as this is a very risky manoeuvre.<\/p>\n<h3>Forgetting to cancel the indicator after exiting<\/h3>\n<p>If you leave your signal on for too long it will confuse other road users. Whether this is classed a driver fault or a serious fault will depend on how long it is before you notice!<\/p>\n<p>&nbsp;<\/p>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Why do we have roundabouts? When two, or more, busy roads intersect – something has to give. Roundabouts are designed to keep traffic moving, ease congestion and speed up journey times. They’re also safer than traditional junctions and crossroads – where drivers can be tempted to run red lights. On roundabouts traffic always travels in<\/p>\n","protected":false},"author":175,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.robinmcdonald.co.uk\/wp-json\/wp\/v2\/posts\/2988"}],"collection":[{"href":"https:\/\/www.robinmcdonald.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.robinmcdonald.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.robinmcdonald.co.uk\/wp-json\/wp\/v2\/users\/175"}],"replies":[{"embeddable":true,"href":"https:\/\/www.robinmcdonald.co.uk\/wp-json\/wp\/v2\/comments?post=2988"}],"version-history":[{"count":1,"href":"https:\/\/www.robinmcdonald.co.uk\/wp-json\/wp\/v2\/posts\/2988\/revisions"}],"predecessor-version":[{"id":2989,"href":"https:\/\/www.robinmcdonald.co.uk\/wp-json\/wp\/v2\/posts\/2988\/revisions\/2989"}],"wp:attachment":[{"href":"https:\/\/www.robinmcdonald.co.uk\/wp-json\/wp\/v2\/media?parent=2988"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.robinmcdonald.co.uk\/wp-json\/wp\/v2\/categories?post=2988"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.robinmcdonald.co.uk\/wp-json\/wp\/v2\/tags?post=2988"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}